Fasten90/FastenTerminal/bin/Debug/JarKon/Atmel/devices/ATSAML21G16A.xml
<?xml version="1.0" encoding="UTF-8"?><!-- ============================================================================ --><!--                  Atmel Microcontroller Software Support                      --><!-- ============================================================================ --><!-- Copyright (c) 2015, Atmel Corporation                                        --><!--                                                                              --><!-- All rights reserved.                                                         --><!--                                                                              --><!-- Redistribution and use in source and binary forms, with or without           --><!-- modification, are permitted provided that the following condition is met:    --><!--                                                                              --><!-- - Redistributions of source code must retain the above copyright notice,     --><!-- this list of conditions and the disclaimer below.                            --><!--                                                                              --><!-- Atmel's name may not be used to endorse or promote products derived from     --><!-- this software without specific prior written permission.                     --><!--                                                                              --><!-- DISCLAIMER: THIS SOFTWARE IS PROVIDED BY ATMEL "AS IS" AND ANY EXPRESS OR    --><!-- IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF --><!-- MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT ARE   --><!-- DISCLAIMED. IN NO EVENT SHALL ATMEL BE LIABLE FOR ANY DIRECT, INDIRECT,      --><!-- INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT --><!-- LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA,  --><!-- OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF    --><!-- LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING         --><!-- NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, --><!-- EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.                           --><!-- ============================================================================ --><avr-tools-device-file xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" schema-version="0.3" xsi:noNamespaceSchemaLocation="../../schema/avr_tools_device_file.xsd">
  <variants>
    <variant ordercode="standard" package="QFP48" speedmax="+0" tempmax="+0" tempmin="+0" vccmax="+0" vccmin="+0"/>
  </variants>
  <devices>
    <device name="ATSAML21G16A" architecture="CORTEX-M0PLUS" family="SAML" series="SAML21">
      <address-spaces>
        <address-space id="base" name="base" start="0" size="0x100000000" endianness="little">
          <memory-segment name="FLASH" start="0x00000000" size="0x10000" type="flash" pagesize="64"/>
          <memory-segment name="USER_PAGE" start="0x00804000" size="0x40" type="user_page" pagesize="64"/>
          <memory-segment name="RWW" start="0x00400000" size="0x800" type="flash" pagesize="64"/>
          <memory-segment name="HSRAM" start="0x20000000" size="0x2000" type="ram"/>
          <memory-segment name="LPRAM" start="0x30000000" size="0x1000" type="ram"/>
          <memory-segment name="HPB0" start="0x40000000" size="0x4000" type="io"/>
          <memory-segment name="HPB1" start="0x41000000" size="0x10000" type="io"/>
          <memory-segment name="HPB2" start="0x42000000" size="0x8000" type="io"/>
          <memory-segment name="HPB3" start="0x43000000" size="0x2000" type="io"/>
          <memory-segment name="HPB4" start="0x44000000" size="0x1000" type="io"/>
          <memory-segment name="PICOPRAM" start="0x50000000" size="0x1000" type="ram"/>
          <memory-segment name="PPB" start="0xE0000000" size="0x100000" type="io"/>
        </address-space>
        <address-space id="fuses" name="fuses" start="0x00800000" size="0x10000" endianness="little"/>
      </address-spaces>
      <parameters>
        <param name="LITTLE_ENDIAN" value="1"/>
        <param name="NUM_IRQ" value="29"/>
        <param name="__CM0PLUS_REV" value="0x0001"/>
        <param name="__MPU_PRESENT" value="0"/>
        <param name="__NVIC_PRIO_BITS" value="2"/>
        <param name="__VTOR_PRESENT" value="1"/>
        <param name="__Vendor_SysTickConfig" value="0"/>
      </parameters>
      <peripherals>
        <module name="AC" id="U2245" version="1.0.1">
          <instance name="AC">
            <register-group name="AC" name-in-module="AC" address-space="base" offset="0x43001000"/>
            <signals>
              <signal group="AIN" index="0" function="B_AC" pad="PA04"/>
              <signal group="AIN" index="1" function="B_AC" pad="PA05"/>
              <signal group="AIN" index="2" function="B_AC" pad="PA06"/>
              <signal group="AIN" index="3" function="B_AC" pad="PA07"/>
              <signal group="CMP" index="0" function="H" pad="PA12"/>
              <signal group="CMP" index="0" function="H" pad="PA18"/>
              <signal group="CMP" index="1" function="H" pad="PA13"/>
              <signal group="CMP" index="1" function="H" pad="PA19"/>
            </signals>
            <parameters>
              <param name="COMPCTRL_MUXNEG_OPAMP" value="7"/>
              <param name="NUM_CMP" value="2"/>
              <param name="PAIRS" value="1"/>
            </parameters>
          </instance>
        </module>
        <module name="ADC" id="U2247" version="1.0.1">
          <instance name="ADC">
            <register-group name="ADC" name-in-module="ADC" address-space="base" offset="0x43000C00"/>
            <signals>
              <signal group="AIN" index="0" function="B_ADC" pad="PA02"/>
              <signal group="AIN" index="1" function="B_ADC" pad="PA03"/>
              <signal group="AIN" index="2" function="B_ADC" pad="PB08"/>
              <signal group="AIN" index="3" function="B_ADC" pad="PB09"/>
              <signal group="AIN" index="4" function="B_ADC" pad="PA04"/>
              <signal group="AIN" index="5" function="B_ADC" pad="PA05"/>
              <signal group="AIN" index="6" function="B_ADC" pad="PA06"/>
              <signal group="AIN" index="7" function="B_ADC" pad="PA07"/>
              <signal group="AIN" index="10" function="B_ADC" pad="PB02"/>
              <signal group="AIN" index="11" function="B_ADC" pad="PB03"/>
              <signal group="AIN" index="16" function="B_ADC" pad="PA08"/>
              <signal group="AIN" index="17" function="B_ADC" pad="PA09"/>
              <signal group="AIN" index="18" function="B_ADC" pad="PA10"/>
              <signal group="AIN" index="19" function="B_ADC" pad="PA11"/>
              <signal group="VREFP" function="B_ANAREF" pad="PA04"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_RESRDY" value="37"/>
              <param name="EXTCHANNEL_MSB" value="19"/>
              <param name="RESULT_BITS" value="16"/>
              <param name="RESULT_MSB" value="15"/>
            </parameters>
          </instance>
        </module>
        <module name="AES" id="U2238" version="2.0.0">
          <instance name="AES">
            <register-group name="AES" name-in-module="AES" address-space="base" offset="0x42003400"/>
            <parameters>
              <param name="DMAC_ID_RD" value="45"/>
              <param name="DMAC_ID_WR" value="44"/>
            </parameters>
          </instance>
        </module>
        <module name="CCL" id="U2225" version="1.0.0">
          <instance name="CCL">
            <register-group name="CCL" name-in-module="CCL" address-space="base" offset="0x43001C00"/>
            <signals>
              <signal group="IN" index="0" function="I" pad="PA04"/>
              <signal group="IN" index="0" function="I" pad="PA16"/>
              <signal group="IN" index="0" function="I" pad="PB22"/>
              <signal group="IN" index="1" function="I" pad="PA05"/>
              <signal group="IN" index="1" function="I" pad="PA17"/>
              <signal group="IN" index="2" function="I" pad="PA06"/>
              <signal group="IN" index="2" function="I" pad="PA18"/>
              <signal group="IN" index="3" function="I" pad="PA08"/>
              <signal group="IN" index="3" function="I" pad="PA30"/>
              <signal group="IN" index="4" function="I" pad="PA09"/>
              <signal group="IN" index="5" function="I" pad="PA10"/>
              <signal group="IN" index="5" function="I" pad="PB10"/>
              <signal group="IN" index="6" function="I" pad="PA22"/>
              <signal group="IN" index="7" function="I" pad="PA23"/>
              <signal group="IN" index="8" function="I" pad="PA24"/>
              <signal group="IN" index="8" function="I" pad="PB08"/>
              <signal group="OUT" index="0" function="I" pad="PA07"/>
              <signal group="OUT" index="0" function="I" pad="PA19"/>
              <signal group="OUT" index="0" function="I" pad="PB02"/>
              <signal group="OUT" index="0" function="I" pad="PB23"/>
              <signal group="OUT" index="1" function="I" pad="PA11"/>
              <signal group="OUT" index="1" function="I" pad="PA31"/>
              <signal group="OUT" index="1" function="I" pad="PB11"/>
              <signal group="OUT" index="2" function="I" pad="PA25"/>
              <signal group="OUT" index="2" function="I" pad="PB09"/>
            </signals>
            <parameters>
              <param name="IO_NUM" value="12"/>
              <param name="LUT_NUM" value="4"/>
              <param name="SEQ_NUM" value="2"/>
            </parameters>
          </instance>
        </module>
        <module name="DAC" id="U2244" version="1.1.0">
          <instance name="DAC">
            <register-group name="DAC" name-in-module="DAC" address-space="base" offset="0x42003000"/>
            <signals>
              <signal group="TCLK" function="DAC_TEST" pad="PA15"/>
              <signal group="TDATA" index="0" function="DAC_TEST" pad="PA16"/>
              <signal group="TDATA" index="1" function="DAC_TEST" pad="PA17"/>
              <signal group="TDATA" index="2" function="DAC_TEST" pad="PA18"/>
              <signal group="TDATA" index="3" function="DAC_TEST" pad="PA19"/>
              <signal group="TDATA" index="6" function="DAC_TEST" pad="PA20"/>
              <signal group="TDATA" index="7" function="DAC_TEST" pad="PA21"/>
              <signal group="TDATA" index="8" function="DAC_TEST" pad="PA22"/>
              <signal group="TDATA" index="9" function="DAC_TEST" pad="PA23"/>
              <signal group="TDATA" index="10" function="DAC_TEST" pad="PA24"/>
              <signal group="TDATA" index="11" function="DAC_TEST" pad="PA25"/>
              <signal group="TEN" index="1" function="DAC_TEST" pad="PB11"/>
              <signal group="VOUT" index="0" function="DAC_TEST" pad="PA02"/>
              <signal group="VOUT" index="0" function="B_DAC" pad="PA02"/>
              <signal group="VOUT" index="1" function="DAC_TEST" pad="PA05"/>
              <signal group="VOUT" index="1" function="B_DAC" pad="PA05"/>
              <signal group="VREFP" function="DAC_TEST" pad="PA03"/>
              <signal group="VREFP" function="B_ANAREF" pad="PA03"/>
            </signals>
            <parameters>
              <param name="DAC_NUM" value="2"/>
              <param name="DATA_SIZE" value="12"/>
            </parameters>
          </instance>
        </module>
        <module name="DMAC" id="U2223" version="2.2.1">
          <instance name="DMAC">
            <register-group name="DMAC" name-in-module="DMAC" address-space="base" offset="0x44000400"/>
            <parameters>
              <param name="CH_BITS" value="4"/>
              <param name="CH_NUM" value="16"/>
              <param name="EVIN_NUM" value="8"/>
              <param name="EVOUT_NUM" value="8"/>
              <param name="LVL_BITS" value="2"/>
              <param name="LVL_NUM" value="4"/>
              <param name="QOSCTRL_D_RESETVALUE" value="2"/>
              <param name="QOSCTRL_F_RESETVALUE" value="2"/>
              <param name="QOSCTRL_WRB_RESETVALUE" value="2"/>
              <param name="TRIG_BITS" value="6"/>
              <param name="TRIG_NUM" value="46"/>
            </parameters>
          </instance>
        </module>
        <module name="DSU" id="U2209" version="2.5.0">
          <instance name="DSU">
            <register-group name="DSU" name-in-module="DSU" address-space="base" offset="0x41002000"/>
