Fasten90/FastenTerminal/bin/Debug/JarKon/Atmel/devices/ATSAML21G16A.xml
        <register name="INTENCLR" offset="0xC" rw="RW" size="4" initval="0x00000000" caption="Interrupt Enable Clear">
          <bitfield name="EXTINT" caption="External Interrupt Disable" mask="0xFFFF"/>
        </register>
        <register name="INTENSET" offset="0x10" rw="RW" size="4" initval="0x00000000" caption="Interrupt Enable Set">
          <bitfield name="EXTINT" caption="External Interrupt Disable" mask="0xFFFF"/>
        </register>
        <register name="INTFLAG" offset="0x14" rw="RW" size="4" initval="0x00000000" caption="Interrupt Flag Status and Clear">
          <bitfield name="EXTINT" caption="External Interrupt Flag" mask="0xFFFF"/>
        </register>
        <register name="EIC_ASYNCH" offset="0x18" rw="RW" size="4" initval="0x00000000" caption="EIC Asynchronous edge Detection Enable">
          <bitfield name="ASYNCH" caption="EIC Asynchronous edge Detection Enable" mask="0xFFFF"/>
        </register>
        <register name="CONFIG" offset="0x1C" rw="RW" size="4" count="2" initval="0x00000000" caption="Configuration n">
          <bitfield name="SENSE0" caption="Input Sense Configuration 0" mask="0x7" values="EIC_CONFIG__SENSE0"/>
          <bitfield name="FILTEN0" caption="Filter Enable 0" mask="0x8"/>
          <bitfield name="SENSE1" caption="Input Sense Configuration 1" mask="0x70" values="EIC_CONFIG__SENSE1"/>
          <bitfield name="FILTEN1" caption="Filter Enable 1" mask="0x80"/>
          <bitfield name="SENSE2" caption="Input Sense Configuration 2" mask="0x700" values="EIC_CONFIG__SENSE2"/>
          <bitfield name="FILTEN2" caption="Filter Enable 2" mask="0x800"/>
          <bitfield name="SENSE3" caption="Input Sense Configuration 3" mask="0x7000" values="EIC_CONFIG__SENSE3"/>
          <bitfield name="FILTEN3" caption="Filter Enable 3" mask="0x8000"/>
          <bitfield name="SENSE4" caption="Input Sense Configuration 4" mask="0x70000" values="EIC_CONFIG__SENSE4"/>
          <bitfield name="FILTEN4" caption="Filter Enable 4" mask="0x80000"/>
          <bitfield name="SENSE5" caption="Input Sense Configuration 5" mask="0x700000" values="EIC_CONFIG__SENSE5"/>
          <bitfield name="FILTEN5" caption="Filter Enable 5" mask="0x800000"/>
          <bitfield name="SENSE6" caption="Input Sense Configuration 6" mask="0x7000000" values="EIC_CONFIG__SENSE6"/>
          <bitfield name="FILTEN6" caption="Filter Enable 6" mask="0x8000000"/>
          <bitfield name="SENSE7" caption="Input Sense Configuration 7" mask="0x70000000" values="EIC_CONFIG__SENSE7"/>
          <bitfield name="FILTEN7" caption="Filter Enable 7" mask="0x80000000"/>
        </register>
      </register-group>
      <value-group name="EIC_NMICTRL__NMISENSE">
        <value name="NONE" caption="No detection" value="0"/>
        <value name="RISE" caption="Rising edge detection" value="1"/>
        <value name="FALL" caption="Falling edge detection" value="2"/>
        <value name="BOTH" caption="Both edges detection" value="3"/>
        <value name="HIGH" caption="High level detection" value="4"/>
        <value name="LOW" caption="Low level detection" value="5"/>
      </value-group>
      <value-group name="EIC_CONFIG__SENSE0">
        <value name="NONE" caption="No detection" value="0"/>
        <value name="RISE" caption="Rising edge detection" value="1"/>
        <value name="FALL" caption="Falling edge detection" value="2"/>
        <value name="BOTH" caption="Both edges detection" value="3"/>
        <value name="HIGH" caption="High level detection" value="4"/>
        <value name="LOW" caption="Low level detection" value="5"/>
      </value-group>
      <value-group name="EIC_CONFIG__SENSE1">
        <value name="NONE" caption="No detection" value="0"/>
        <value name="RISE" caption="Rising edge detection" value="1"/>
        <value name="FALL" caption="Falling edge detection" value="2"/>
        <value name="BOTH" caption="Both edges detection" value="3"/>
        <value name="HIGH" caption="High level detection" value="4"/>
        <value name="LOW" caption="Low level detection" value="5"/>
      </value-group>
      <value-group name="EIC_CONFIG__SENSE2">
        <value name="NONE" caption="No detection" value="0"/>
        <value name="RISE" caption="Rising edge detection" value="1"/>
        <value name="FALL" caption="Falling edge detection" value="2"/>
        <value name="BOTH" caption="Both edges detection" value="3"/>
        <value name="HIGH" caption="High level detection" value="4"/>
        <value name="LOW" caption="Low level detection" value="5"/>
      </value-group>
      <value-group name="EIC_CONFIG__SENSE3">
        <value name="NONE" caption="No detection" value="0"/>
        <value name="RISE" caption="Rising edge detection" value="1"/>
        <value name="FALL" caption="Falling edge detection" value="2"/>
        <value name="BOTH" caption="Both edges detection" value="3"/>
        <value name="HIGH" caption="High level detection" value="4"/>
        <value name="LOW" caption="Low level detection" value="5"/>
      </value-group>
      <value-group name="EIC_CONFIG__SENSE4">
        <value name="NONE" caption="No detection" value="0"/>
        <value name="RISE" caption="Rising edge detection" value="1"/>
        <value name="FALL" caption="Falling edge detection" value="2"/>
        <value name="BOTH" caption="Both edges detection" value="3"/>
        <value name="HIGH" caption="High level detection" value="4"/>
        <value name="LOW" caption="Low level detection" value="5"/>
      </value-group>
      <value-group name="EIC_CONFIG__SENSE5">
        <value name="NONE" caption="No detection" value="0"/>
        <value name="RISE" caption="Rising edge detection" value="1"/>
        <value name="FALL" caption="Falling edge detection" value="2"/>
        <value name="BOTH" caption="Both edges detection" value="3"/>
        <value name="HIGH" caption="High level detection" value="4"/>
        <value name="LOW" caption="Low level detection" value="5"/>
      </value-group>
      <value-group name="EIC_CONFIG__SENSE6">
        <value name="NONE" caption="No detection" value="0"/>
        <value name="RISE" caption="Rising edge detection" value="1"/>
        <value name="FALL" caption="Falling edge detection" value="2"/>
        <value name="BOTH" caption="Both edges detection" value="3"/>
        <value name="HIGH" caption="High level detection" value="4"/>
        <value name="LOW" caption="Low level detection" value="5"/>
      </value-group>
      <value-group name="EIC_CONFIG__SENSE7">
        <value name="NONE" caption="No detection" value="0"/>
        <value name="RISE" caption="Rising edge detection" value="1"/>
        <value name="FALL" caption="Falling edge detection" value="2"/>
        <value name="BOTH" caption="Both edges detection" value="3"/>
        <value name="HIGH" caption="High level detection" value="4"/>
        <value name="LOW" caption="Low level detection" value="5"/>
      </value-group>
    </module>
    <module name="EVSYS" id="U2256" version="1.0.0" caption="Event System Interface">
      <register-group name="EVSYS" caption="Event System Interface">
        <register name="CTRLA" offset="0x0" rw="RW" size="1" initval="0x00" caption="Control">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
        </register>
        <register name="CHSTATUS" offset="0xC" rw="R" size="4" initval="0x00000000" caption="Channel Status">
          <bitfield name="USRRDY0" caption="Channel 0 User Ready" mask="0x1"/>
          <bitfield name="USRRDY1" caption="Channel 1 User Ready" mask="0x2"/>
          <bitfield name="USRRDY2" caption="Channel 2 User Ready" mask="0x4"/>
          <bitfield name="USRRDY3" caption="Channel 3 User Ready" mask="0x8"/>
          <bitfield name="USRRDY4" caption="Channel 4 User Ready" mask="0x10"/>
          <bitfield name="USRRDY5" caption="Channel 5 User Ready" mask="0x20"/>
          <bitfield name="USRRDY6" caption="Channel 6 User Ready" mask="0x40"/>
          <bitfield name="USRRDY7" caption="Channel 7 User Ready" mask="0x80"/>
          <bitfield name="USRRDY8" caption="Channel 8 User Ready" mask="0x100"/>
          <bitfield name="USRRDY9" caption="Channel 9 User Ready" mask="0x200"/>
          <bitfield name="USRRDY10" caption="Channel 10 User Ready" mask="0x400"/>
          <bitfield name="USRRDY11" caption="Channel 11 User Ready" mask="0x800"/>
          <bitfield name="CHBUSY0" caption="Channel 0 Busy" mask="0x10000"/>
          <bitfield name="CHBUSY1" caption="Channel 1 Busy" mask="0x20000"/>
          <bitfield name="CHBUSY2" caption="Channel 2 Busy" mask="0x40000"/>
          <bitfield name="CHBUSY3" caption="Channel 3 Busy" mask="0x80000"/>
          <bitfield name="CHBUSY4" caption="Channel 4 Busy" mask="0x100000"/>
          <bitfield name="CHBUSY5" caption="Channel 5 Busy" mask="0x200000"/>
          <bitfield name="CHBUSY6" caption="Channel 6 Busy" mask="0x400000"/>
          <bitfield name="CHBUSY7" caption="Channel 7 Busy" mask="0x800000"/>
          <bitfield name="CHBUSY8" caption="Channel 8 Busy" mask="0x1000000"/>
          <bitfield name="CHBUSY9" caption="Channel 9 Busy" mask="0x2000000"/>
          <bitfield name="CHBUSY10" caption="Channel 10 Busy" mask="0x4000000"/>
          <bitfield name="CHBUSY11" caption="Channel 11 Busy" mask="0x8000000"/>
        </register>
        <register name="INTENCLR" offset="0x10" rw="RW" size="4" initval="0x00000000" caption="Interrupt Enable Clear">
          <bitfield name="OVR0" caption="Channel 0 Overrun Interrupt Enable" mask="0x1"/>
          <bitfield name="OVR1" caption="Channel 1 Overrun Interrupt Enable" mask="0x2"/>
          <bitfield name="OVR2" caption="Channel 2 Overrun Interrupt Enable" mask="0x4"/>
          <bitfield name="OVR3" caption="Channel 3 Overrun Interrupt Enable" mask="0x8"/>
          <bitfield name="OVR4" caption="Channel 4 Overrun Interrupt Enable" mask="0x10"/>
          <bitfield name="OVR5" caption="Channel 5 Overrun Interrupt Enable" mask="0x20"/>
          <bitfield name="OVR6" caption="Channel 6 Overrun Interrupt Enable" mask="0x40"/>
          <bitfield name="OVR7" caption="Channel 7 Overrun Interrupt Enable" mask="0x80"/>
          <bitfield name="OVR8" caption="Channel 8 Overrun Interrupt Enable" mask="0x100"/>
          <bitfield name="OVR9" caption="Channel 9 Overrun Interrupt Enable" mask="0x200"/>
          <bitfield name="OVR10" caption="Channel 10 Overrun Interrupt Enable" mask="0x400"/>
          <bitfield name="OVR11" caption="Channel 11 Overrun Interrupt Enable" mask="0x800"/>
          <bitfield name="EVD0" caption="Channel 0 Event Detection Interrupt Enable" mask="0x10000"/>
          <bitfield name="EVD1" caption="Channel 1 Event Detection Interrupt Enable" mask="0x20000"/>
          <bitfield name="EVD2" caption="Channel 2 Event Detection Interrupt Enable" mask="0x40000"/>
          <bitfield name="EVD3" caption="Channel 3 Event Detection Interrupt Enable" mask="0x80000"/>
          <bitfield name="EVD4" caption="Channel 4 Event Detection Interrupt Enable" mask="0x100000"/>
          <bitfield name="EVD5" caption="Channel 5 Event Detection Interrupt Enable" mask="0x200000"/>
          <bitfield name="EVD6" caption="Channel 6 Event Detection Interrupt Enable" mask="0x400000"/>
          <bitfield name="EVD7" caption="Channel 7 Event Detection Interrupt Enable" mask="0x800000"/>
          <bitfield name="EVD8" caption="Channel 8 Event Detection Interrupt Enable" mask="0x1000000"/>
          <bitfield name="EVD9" caption="Channel 9 Event Detection Interrupt Enable" mask="0x2000000"/>
          <bitfield name="EVD10" caption="Channel 10 Event Detection Interrupt Enable" mask="0x4000000"/>
          <bitfield name="EVD11" caption="Channel 11 Event Detection Interrupt Enable" mask="0x8000000"/>
        </register>
        <register name="INTENSET" offset="0x14" rw="RW" size="4" initval="0x00000000" caption="Interrupt Enable Set">
          <bitfield name="OVR0" caption="Channel 0 Overrun Interrupt Enable" mask="0x1"/>
          <bitfield name="OVR1" caption="Channel 1 Overrun Interrupt Enable" mask="0x2"/>
          <bitfield name="OVR2" caption="Channel 2 Overrun Interrupt Enable" mask="0x4"/>
          <bitfield name="OVR3" caption="Channel 3 Overrun Interrupt Enable" mask="0x8"/>
          <bitfield name="OVR4" caption="Channel 4 Overrun Interrupt Enable" mask="0x10"/>
          <bitfield name="OVR5" caption="Channel 5 Overrun Interrupt Enable" mask="0x20"/>
          <bitfield name="OVR6" caption="Channel 6 Overrun Interrupt Enable" mask="0x40"/>
          <bitfield name="OVR7" caption="Channel 7 Overrun Interrupt Enable" mask="0x80"/>
          <bitfield name="OVR8" caption="Channel 8 Overrun Interrupt Enable" mask="0x100"/>
          <bitfield name="OVR9" caption="Channel 9 Overrun Interrupt Enable" mask="0x200"/>
          <bitfield name="OVR10" caption="Channel 10 Overrun Interrupt Enable" mask="0x400"/>
          <bitfield name="OVR11" caption="Channel 11 Overrun Interrupt Enable" mask="0x800"/>
          <bitfield name="EVD0" caption="Channel 0 Event Detection Interrupt Enable" mask="0x10000"/>
          <bitfield name="EVD1" caption="Channel 1 Event Detection Interrupt Enable" mask="0x20000"/>
          <bitfield name="EVD2" caption="Channel 2 Event Detection Interrupt Enable" mask="0x40000"/>
          <bitfield name="EVD3" caption="Channel 3 Event Detection Interrupt Enable" mask="0x80000"/>
          <bitfield name="EVD4" caption="Channel 4 Event Detection Interrupt Enable" mask="0x100000"/>
          <bitfield name="EVD5" caption="Channel 5 Event Detection Interrupt Enable" mask="0x200000"/>
          <bitfield name="EVD6" caption="Channel 6 Event Detection Interrupt Enable" mask="0x400000"/>
          <bitfield name="EVD7" caption="Channel 7 Event Detection Interrupt Enable" mask="0x800000"/>
          <bitfield name="EVD8" caption="Channel 8 Event Detection Interrupt Enable" mask="0x1000000"/>
          <bitfield name="EVD9" caption="Channel 9 Event Detection Interrupt Enable" mask="0x2000000"/>
          <bitfield name="EVD10" caption="Channel 10 Event Detection Interrupt Enable" mask="0x4000000"/>
          <bitfield name="EVD11" caption="Channel 11 Event Detection Interrupt Enable" mask="0x8000000"/>
        </register>
