Fasten90/FastenTerminal/bin/Debug/JarKon/Atmel/devices/ATSAML21G16A.xml
        <register name="STATUS" offset="0xC" rw="R" size="4" initval="0x00000000" caption="Power and Clocks Status">
          <bitfield name="XOSCRDY" caption="XOSC Ready" mask="0x1"/>
          <bitfield name="OSC16MRDY" caption="OSC16M Ready" mask="0x10"/>
          <bitfield name="DFLLRDY" caption="DFLL Ready" mask="0x100"/>
          <bitfield name="DFLLOOB" caption="DFLL Out Of Bounds" mask="0x200"/>
          <bitfield name="DFLLLCKF" caption="DFLL Lock Fine" mask="0x400"/>
          <bitfield name="DFLLLCKC" caption="DFLL Lock Coarse" mask="0x800"/>
          <bitfield name="DFLLRCS" caption="DFLL Reference Clock Stopped" mask="0x1000"/>
          <bitfield name="DPLLLCKR" caption="DPLL Lock Rise" mask="0x10000"/>
          <bitfield name="DPLLLCKF" caption="DPLL Lock Fall" mask="0x20000"/>
          <bitfield name="DPLLTO" caption="DPLL Timeout" mask="0x40000"/>
          <bitfield name="DPLLLDRTO" caption="DPLL Ratio Ready" mask="0x80000"/>
        </register>
        <register name="XOSCCTRL" offset="0x10" rw="RW" size="2" initval="0x0080" caption="External Multipurpose Crystal Oscillator (XOSC) Control">
          <bitfield name="ENABLE" caption="Oscillator Enable" mask="0x2"/>
          <bitfield name="XTALEN" caption="Crystal Oscillator Enable" mask="0x4"/>
          <bitfield name="RUNSTDBY" caption="Run in Standby" mask="0x40"/>
          <bitfield name="ONDEMAND" caption="On Demand Control" mask="0x80"/>
          <bitfield name="GAIN" caption="Oscillator Gain" mask="0x700"/>
          <bitfield name="AMPGC" caption="Automatic Amplitude Gain Control" mask="0x800"/>
          <bitfield name="STARTUP" caption="Start-Up Time" mask="0xF000"/>
        </register>
        <register name="OSC16MCTRL" offset="0x14" rw="RW" size="1" initval="0x82" caption="16MHz Internal Oscillator (OSC16M) Control">
          <bitfield name="ENABLE" caption="Oscillator Enable" mask="0x2"/>
          <bitfield name="FSEL" caption="Oscillator Frequency Select" mask="0xC" values="OSCCTRL_OSC16MCTRL__FSEL"/>
          <bitfield name="RUNSTDBY" caption="Run in Standby" mask="0x40"/>
          <bitfield name="ONDEMAND" caption="On Demand Control" mask="0x80"/>
        </register>
        <register name="DFLLCTRL" offset="0x18" rw="RW" size="2" initval="0x0080" caption="DFLL48M Control">
          <bitfield name="ENABLE" caption="DFLL Enable" mask="0x2"/>
          <bitfield name="MODE" caption="Operating Mode Selection" mask="0x4"/>
          <bitfield name="STABLE" caption="Stable DFLL Frequency" mask="0x8"/>
          <bitfield name="LLAW" caption="Lose Lock After Wake" mask="0x10"/>
          <bitfield name="USBCRM" caption="USB Clock Recovery Mode" mask="0x20"/>
          <bitfield name="RUNSTDBY" caption="Run in Standby" mask="0x40"/>
          <bitfield name="ONDEMAND" caption="On Demand Control" mask="0x80"/>
          <bitfield name="CCDIS" caption="Chill Cycle Disable" mask="0x100"/>
          <bitfield name="QLDIS" caption="Quick Lock Disable" mask="0x200"/>
          <bitfield name="BPLCKC" caption="Bypass Coarse Lock" mask="0x400"/>
          <bitfield name="WAITLOCK" caption="Wait Lock" mask="0x800"/>
        </register>
        <register name="DFLLVAL" offset="0x1C" rw="RW" size="4" initval="0x00000000" caption="DFLL48M Value">
          <bitfield name="FINE" caption="Fine Value" mask="0x3FF"/>
          <bitfield name="COARSE" caption="Coarse Value" mask="0xFC00"/>
          <bitfield name="DIFF" caption="Multiplication Ratio Difference" mask="0xFFFF0000"/>
        </register>
        <register name="DFLLMUL" offset="0x20" rw="RW" size="4" initval="0x00000000" caption="DFLL48M Multiplier">
          <bitfield name="MUL" caption="DFLL Multiply Factor" mask="0xFFFF"/>
          <bitfield name="FSTEP" caption="Fine Maximum Step" mask="0x3FF0000"/>
          <bitfield name="CSTEP" caption="Coarse Maximum Step" mask="0xFC000000"/>
        </register>
        <register name="DFLLSYNC" offset="0x24" rw="RW" size="1" initval="0x00" caption="DFLL48M Synchronization">
          <bitfield name="READREQ" caption="Read Request" mask="0x80"/>
        </register>
        <register name="DPLLCTRLA" offset="0x28" rw="RW" size="1" initval="0x80" caption="DPLL Control">
          <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
          <bitfield name="RUNSTDBY" caption="Run in Standby" mask="0x40"/>
          <bitfield name="ONDEMAND" caption="On Demand" mask="0x80"/>
        </register>
        <register name="DPLLRATIO" offset="0x2C" rw="RW" size="4" initval="0x00000000" caption="DPLL Ratio Control">
          <bitfield name="LDR" caption="Loop Divider Ratio" mask="0xFFF"/>
          <bitfield name="LDRFRAC" caption="Loop Divider Ratio Fractional Part" mask="0xF0000"/>
        </register>
        <register name="DPLLCTRLB" offset="0x30" rw="RW" size="4" initval="0x00000000" caption="Digital Core Configuration">
          <bitfield name="FILTER" caption="Proportional Integral Filter Selection" mask="0x3"/>
          <bitfield name="LPEN" caption="Low-Power Enable" mask="0x4"/>
          <bitfield name="WUF" caption="Wake Up Fast" mask="0x8"/>
          <bitfield name="REFCLK" caption="Reference Clock Selection" mask="0x30"/>
          <bitfield name="LTIME" caption="Lock Time" mask="0x700"/>
          <bitfield name="LBYPASS" caption="Lock Bypass" mask="0x1000"/>
          <bitfield name="DIV" caption="Clock Divider" mask="0x7FF0000"/>
        </register>
        <register name="DPLLPRESC" offset="0x34" rw="RW" size="1" initval="0x00" caption="DPLL Prescaler">
          <bitfield name="PRESC" caption="Output Clock Prescaler" mask="0x3" values="OSCCTRL_DPLLPRESC__PRESC"/>
        </register>
        <register name="DPLLSYNCBUSY" offset="0x38" rw="R" size="1" initval="0x00" caption="DPLL Synchronization Busy">
          <bitfield name="ENABLE" caption="DPLL Enable Synchronization Status" mask="0x2"/>
          <bitfield name="DPLLRATIO" caption="DPLL Ratio Synchronization Status" mask="0x4"/>
          <bitfield name="DPLLPRESC" caption="DPLL Prescaler Synchronization Status" mask="0x8"/>
        </register>
        <register name="DPLLSTATUS" offset="0x3C" rw="R" size="1" initval="0x00" caption="DPLL Status">
          <bitfield name="LOCK" caption="DPLL Lock Status" mask="0x1"/>
          <bitfield name="CLKRDY" caption="DPLL Clock Ready" mask="0x2"/>
        </register>
      </register-group>
