Fasten90/FastenTerminal/bin/Debug/JarKon/Atmel/devices/ATSAML21G16A.xml
      <value-group name="OSCCTRL_OSC16MCTRL__FSEL">
        <value name="4" caption="4MHz" value="0x0"/>
        <value name="8" caption="8MHz" value="0x1"/>
        <value name="12" caption="12MHz" value="0x2"/>
        <value name="16" caption="16MHz" value="0x3"/>
      </value-group>
      <value-group name="OSCCTRL_DPLLPRESC__PRESC">
        <value name="DIV1" caption="DPLL output is divided by 1" value="0"/>
        <value name="DIV2" caption="DPLL output is divided by 2" value="1"/>
        <value name="DIV4" caption="DPLL output is divided by 4" value="2"/>
      </value-group>
    </module>
    <module name="OSC32KCTRL" id="U2246" version="1.1.0" caption="32k Oscillators Control">
      <register-group name="OSC32KCTRL" caption="32k Oscillators Control">
        <register name="INTENCLR" offset="0x0" rw="RW" size="4" initval="0x00000000" caption="Interrupt Enable Clear">
          <bitfield name="XOSC32KRDY" caption="XOSC32K Ready Interrupt Enable" mask="0x1"/>
          <bitfield name="OSC32KRDY" caption="OSC32K Ready Interrupt Enable" mask="0x2"/>
        </register>
        <register name="INTENSET" offset="0x4" rw="RW" size="4" initval="0x00000000" caption="Interrupt Enable Set">
          <bitfield name="XOSC32KRDY" caption="XOSC32K Ready Interrupt Enable" mask="0x1"/>
          <bitfield name="OSC32KRDY" caption="OSC32K Ready Interrupt Enable" mask="0x2"/>
        </register>
        <register name="INTFLAG" offset="0x8" rw="RW" size="4" initval="0x00000000" caption="Interrupt Flag Status and Clear">
          <bitfield name="XOSC32KRDY" caption="XOSC32K Ready" mask="0x1"/>
          <bitfield name="OSC32KRDY" caption="OSC32K Ready" mask="0x2"/>
        </register>
        <register name="STATUS" offset="0xC" rw="R" size="4" initval="0x00000000" caption="Power and Clocks Status">
          <bitfield name="XOSC32KRDY" caption="XOSC32K Ready" mask="0x1"/>
          <bitfield name="OSC32KRDY" caption="OSC32K Ready" mask="0x2"/>
        </register>
        <register name="RTCCTRL" offset="0x10" rw="RW" size="4" initval="0x00000000" caption="Clock selection">
          <bitfield name="RTCSEL" caption="RTC Clock Selection" mask="0x7" values="OSC32KCTRL_RTCCTRL__RTCSEL"/>
        </register>
        <register name="XOSC32K" offset="0x14" rw="RW" size="4" initval="0x00000080" caption="32kHz External Crystal Oscillator (XOSC32K) Control">
          <bitfield name="ENABLE" caption="Oscillator Enable" mask="0x2"/>
          <bitfield name="XTALEN" caption="Crystal Oscillator Enable" mask="0x4"/>
          <bitfield name="EN32K" caption="32kHz Output Enable" mask="0x8"/>
          <bitfield name="EN1K" caption="1kHz Output Enable" mask="0x10"/>
          <bitfield name="RUNSTDBY" caption="Run in Standby" mask="0x40"/>
          <bitfield name="ONDEMAND" caption="On Demand Control" mask="0x80"/>
          <bitfield name="STARTUP" caption="Oscillator Start-Up Time" mask="0x700"/>
          <bitfield name="WRTLOCK" caption="Write Lock" mask="0x1000"/>
        </register>
        <register name="OSC32K" offset="0x18" rw="RW" size="4" initval="0x003F0080" caption="32kHz Internal Oscillator (OSC32K) Control">
          <bitfield name="ENABLE" caption="Oscillator Enable" mask="0x2"/>
          <bitfield name="EN32K" caption="32kHz Output Enable" mask="0x4"/>
          <bitfield name="EN1K" caption="1kHz Output Enable" mask="0x8"/>
          <bitfield name="RUNSTDBY" caption="Run in Standby" mask="0x40"/>
          <bitfield name="ONDEMAND" caption="On Demand Control" mask="0x80"/>
          <bitfield name="STARTUP" caption="Oscillator Start-Up Time" mask="0x700"/>
          <bitfield name="WRTLOCK" caption="Write Lock" mask="0x1000"/>
          <bitfield name="CALIB" caption="Oscillator Calibration" mask="0x7F0000"/>
        </register>
        <register name="OSCULP32K" offset="0x1C" rw="RW" size="4" caption="32kHz Ultra Low Power Internal Oscillator (OSCULP32K) Control">
          <bitfield name="EN32K" caption="Enable Out 32k" mask="0x2"/>
          <bitfield name="EN1K" caption="Enable Out 1k" mask="0x4"/>
          <bitfield name="CALIB" caption="Oscillator Calibration" mask="0x1F00"/>
          <bitfield name="WRTLOCK" caption="Write Lock" mask="0x8000"/>
        </register>
      </register-group>
      <value-group name="OSC32KCTRL_RTCCTRL__RTCSEL">
        <value name="ULP1K" caption="1.024kHz from 32kHz internal ULP oscillator" value="0"/>
        <value name="ULP32K" caption="32.768kHz from 32kHz internal ULP oscillator" value="1"/>
        <value name="OSC1K" caption="1.024kHz from 32.768kHz internal oscillator" value="2"/>
        <value name="OSC32K" caption="32.768kHz from 32.768kHz internal oscillator" value="3"/>
        <value name="XOSC1K" caption="1.024kHz from 32.768kHz internal oscillator" value="4"/>
        <value name="XOSC32K" caption="32.768kHz from 32.768kHz external crystal oscillator" value="5"/>
      </value-group>
    </module>
    <module name="PAC" id="U2120" version="1.1.0" caption="Peripheral Access Controller">
      <register-group name="PAC" caption="Peripheral Access Controller">
        <register name="WRCTRL" offset="0x0" rw="RW" size="4" initval="0x00000000" caption="Write control">
          <bitfield name="PERID" caption="Peripheral identifier" mask="0xFFFF"/>
          <bitfield name="KEY" caption="Peripheral access control key" mask="0xFF0000" values="PAC_WRCTRL__KEY"/>
        </register>
        <register name="EVCTRL" offset="0x4" rw="RW" size="1" initval="0x00" caption="Event control">
          <bitfield name="ERREO" caption="Peripheral acess error event output" mask="0x1"/>
        </register>
        <register name="INTENCLR" offset="0x8" rw="RW" size="1" initval="0x00" caption="Interrupt enable clear">
          <bitfield name="ERR" caption="Peripheral access error interrupt disable" mask="0x1"/>
        </register>
        <register name="INTENSET" offset="0x9" rw="RW" size="1" initval="0x00" caption="Interrupt enable set">
          <bitfield name="ERR" caption="Peripheral access error interrupt enable" mask="0x1"/>
        </register>
        <register name="INTFLAGAHB" offset="0x10" rw="RW" size="4" initval="0x00000000" caption="Bridge interrupt flag status">
          <bitfield name="FLASH_" caption="FLASH" mask="0x1"/>
          <bitfield name="HSRAMCM0P_" caption="HSRAMCM0P" mask="0x2"/>
          <bitfield name="HSRAMDSU_" caption="HSRAMDSU" mask="0x4"/>
          <bitfield name="HPB1_" caption="HPB1" mask="0x8"/>
          <bitfield name="H2LBRIDGES_" caption="H2LBRIDGES" mask="0x10"/>
          <bitfield name="HPB0_" caption="HPB0" mask="0x10000"/>
          <bitfield name="HPB2_" caption="HPB2" mask="0x20000"/>
          <bitfield name="HPB3_" caption="HPB3" mask="0x40000"/>
          <bitfield name="HPB4_" caption="HPB4" mask="0x80000"/>
          <bitfield name="PICOPRAM_" caption="PICOPRAM" mask="0x100000"/>
          <bitfield name="LPRAMHS_" caption="LPRAMHS" mask="0x200000"/>
          <bitfield name="LPRAMPICOP_" caption="LPRAMPICOP" mask="0x400000"/>
          <bitfield name="LPRAMDMAC_" caption="LPRAMDMAC" mask="0x800000"/>
          <bitfield name="L2HBRIDGES_" caption="L2HBRIDGES" mask="0x1000000"/>
          <bitfield name="HSRAMLP_" caption="HSRAMLP" mask="0x2000000"/>
        </register>
        <register name="INTFLAGA" offset="0x14" rw="RW" size="4" initval="0x00000000" caption="Peripheral interrupt flag status - Bridge A">
          <bitfield name="PM_" caption="PM" mask="0x1"/>
          <bitfield name="MCLK_" caption="MCLK" mask="0x2"/>
          <bitfield name="RSTC_" caption="RSTC" mask="0x4"/>
          <bitfield name="OSCCTRL_" caption="OSCCTRL" mask="0x8"/>
          <bitfield name="OSC32KCTRL_" caption="OSC32KCTRL" mask="0x10"/>
          <bitfield name="SUPC_" caption="SUPC" mask="0x20"/>
          <bitfield name="GCLK_" caption="GCLK" mask="0x40"/>
          <bitfield name="WDT_" caption="WDT" mask="0x80"/>
          <bitfield name="RTC_" caption="RTC" mask="0x100"/>
          <bitfield name="EIC_" caption="EIC" mask="0x200"/>
          <bitfield name="PORT_" caption="PORT" mask="0x400"/>
          <bitfield name="TAL_" caption="TAL" mask="0x800"/>
        </register>
        <register name="INTFLAGB" offset="0x18" rw="RW" size="4" initval="0x00000000" caption="Peripheral interrupt flag status - Bridge B">
          <bitfield name="USB_" caption="USB" mask="0x1"/>
          <bitfield name="DSU_" caption="DSU" mask="0x2"/>
          <bitfield name="NVMCTRL_" caption="NVMCTRL" mask="0x4"/>
          <bitfield name="MTB_" caption="MTB" mask="0x8"/>
        </register>
        <register name="INTFLAGC" offset="0x1C" rw="RW" size="4" initval="0x00000000" caption="Peripheral interrupt flag status - Bridge C">
          <bitfield name="SERCOM0_" caption="SERCOM0" mask="0x1"/>
          <bitfield name="SERCOM1_" caption="SERCOM1" mask="0x2"/>
          <bitfield name="SERCOM2_" caption="SERCOM2" mask="0x4"/>
          <bitfield name="SERCOM3_" caption="SERCOM3" mask="0x8"/>
          <bitfield name="SERCOM4_" caption="SERCOM4" mask="0x10"/>
          <bitfield name="TCC0_" caption="TCC0" mask="0x20"/>
          <bitfield name="TCC1_" caption="TCC1" mask="0x40"/>
          <bitfield name="TCC2_" caption="TCC2" mask="0x80"/>
          <bitfield name="TC0_" caption="TC0" mask="0x100"/>
          <bitfield name="TC1_" caption="TC1" mask="0x200"/>
          <bitfield name="DAC_" caption="DAC" mask="0x1000"/>
          <bitfield name="AES_" caption="AES" mask="0x2000"/>
          <bitfield name="TRNG_" caption="TRNG" mask="0x4000"/>
        </register>
        <register name="INTFLAGD" offset="0x20" rw="RW" size="4" initval="0x00000000" caption="Peripheral interrupt flag status - Bridge D">
          <bitfield name="EVSYS_" caption="EVSYS" mask="0x1"/>
          <bitfield name="SERCOM5_" caption="SERCOM5" mask="0x2"/>
          <bitfield name="TC4_" caption="TC4" mask="0x4"/>
          <bitfield name="ADC_" caption="ADC" mask="0x8"/>
          <bitfield name="AC_" caption="AC" mask="0x10"/>
          <bitfield name="PTC_" caption="PTC" mask="0x20"/>
          <bitfield name="OPAMP_" caption="OPAMP" mask="0x40"/>
          <bitfield name="CCL_" caption="CCL" mask="0x80"/>
        </register>
        <register name="INTFLAGE" offset="0x24" rw="RW" size="4" initval="0x00000000" caption="Peripheral interrupt flag status - Bridge E">
          <bitfield name="PAC_" caption="PAC" mask="0x1"/>
          <bitfield name="DMAC_" caption="DMAC" mask="0x2"/>
        </register>
        <register name="STATUSA" offset="0x34" rw="R" size="4" initval="0x00003000" caption="Peripheral write protection status - Bridge A">
          <bitfield name="PM_" caption="PM APB Protect Enable" mask="0x1"/>
          <bitfield name="MCLK_" caption="MCLK APB Protect Enable" mask="0x2"/>
          <bitfield name="RSTC_" caption="RSTC APB Protect Enable" mask="0x4"/>
          <bitfield name="OSCCTRL_" caption="OSCCTRL APB Protect Enable" mask="0x8"/>
          <bitfield name="OSC32KCTRL_" caption="OSC32KCTRL APB Protect Enable" mask="0x10"/>
          <bitfield name="SUPC_" caption="SUPC APB Protect Enable" mask="0x20"/>
          <bitfield name="GCLK_" caption="GCLK APB Protect Enable" mask="0x40"/>
          <bitfield name="WDT_" caption="WDT APB Protect Enable" mask="0x80"/>
          <bitfield name="RTC_" caption="RTC APB Protect Enable" mask="0x100"/>
          <bitfield name="EIC_" caption="EIC APB Protect Enable" mask="0x200"/>
          <bitfield name="PORT_" caption="PORT APB Protect Enable" mask="0x400"/>
          <bitfield name="TAL_" caption="TAL APB Protect Enable" mask="0x800"/>
        </register>
