Fasten90/FastenTerminal/bin/Debug/JarKon/Atmel/devices/ATSAML21G16A.xml
        <register name="EVCPUSEL0" offset="0x48" rw="RW" size="4" initval="0x00000000" caption="EVSYS Channel Interrupts CPU Select 0">
          <bitfield name="CH0" caption="Event Channel 0 Interrupt CPU Select" mask="0x1"/>
          <bitfield name="CH1" caption="Event Channel 1 Interrupt CPU Select" mask="0x4"/>
          <bitfield name="CH2" caption="Event Channel 2 Interrupt CPU Select" mask="0x10"/>
          <bitfield name="CH3" caption="Event Channel 3 Interrupt CPU Select" mask="0x40"/>
          <bitfield name="CH4" caption="Event Channel 4 Interrupt CPU Select" mask="0x100"/>
          <bitfield name="CH5" caption="Event Channel 5 Interrupt CPU Select" mask="0x400"/>
          <bitfield name="CH6" caption="Event Channel 6 Interrupt CPU Select" mask="0x1000"/>
          <bitfield name="CH7" caption="Event Channel 7 Interrupt CPU Select" mask="0x4000"/>
          <bitfield name="CH8" caption="Event Channel 8 Interrupt CPU Select" mask="0x10000"/>
          <bitfield name="CH9" caption="Event Channel 9 Interrupt CPU Select" mask="0x40000"/>
          <bitfield name="CH10" caption="Event Channel 10 Interrupt CPU Select" mask="0x100000"/>
          <bitfield name="CH11" caption="Event Channel 11 Interrupt CPU Select" mask="0x400000"/>
        </register>
        <register name="EICCPUSEL0" offset="0x50" rw="RW" size="4" initval="0x00000000" caption="EIC External Interrupts CPU Select 0">
          <bitfield name="EXTINT0" caption="External Interrupt 0 CPU Select" mask="0x1"/>
          <bitfield name="EXTINT1" caption="External Interrupt 1 CPU Select" mask="0x4"/>
          <bitfield name="EXTINT2" caption="External Interrupt 2 CPU Select" mask="0x10"/>
          <bitfield name="EXTINT3" caption="External Interrupt 3 CPU Select" mask="0x40"/>
          <bitfield name="EXTINT4" caption="External Interrupt 4 CPU Select" mask="0x100"/>
          <bitfield name="EXTINT5" caption="External Interrupt 5 CPU Select" mask="0x400"/>
          <bitfield name="EXTINT6" caption="External Interrupt 6 CPU Select" mask="0x1000"/>
          <bitfield name="EXTINT7" caption="External Interrupt 7 CPU Select" mask="0x4000"/>
          <bitfield name="EXTINT8" caption="External Interrupt 8 CPU Select" mask="0x10000"/>
          <bitfield name="EXTINT9" caption="External Interrupt 9 CPU Select" mask="0x40000"/>
          <bitfield name="EXTINT10" caption="External Interrupt 10 CPU Select" mask="0x100000"/>
          <bitfield name="EXTINT11" caption="External Interrupt 11 CPU Select" mask="0x400000"/>
          <bitfield name="EXTINT12" caption="External Interrupt 12 CPU Select" mask="0x1000000"/>
          <bitfield name="EXTINT13" caption="External Interrupt 13 CPU Select" mask="0x4000000"/>
          <bitfield name="EXTINT14" caption="External Interrupt 14 CPU Select" mask="0x10000000"/>
          <bitfield name="EXTINT15" caption="External Interrupt 15 CPU Select" mask="0x40000000"/>
        </register>
        <register name="INTCPUSEL0" offset="0x58" rw="RW" size="4" initval="0x00000000" caption="Interrupts CPU Select 0">
          <bitfield name="SYSTEM" caption="SYSTEM Interrupt CPU Select" mask="0x1"/>
          <bitfield name="WDT" caption="WDT Interrupt CPU Select" mask="0x4"/>
          <bitfield name="RTC" caption="RTC Interrupt CPU Select" mask="0x10"/>
          <bitfield name="NVMCTRL" caption="NVMCTRL Interrupt CPU Select" mask="0x100"/>
          <bitfield name="USB" caption="USB Interrupt CPU Select" mask="0x1000"/>
          <bitfield name="SERCOM0" caption="SERCOM0 Interrupt CPU Select" mask="0x10000"/>
          <bitfield name="SERCOM1" caption="SERCOM1 Interrupt CPU Select" mask="0x40000"/>
          <bitfield name="SERCOM2" caption="SERCOM2 Interrupt CPU Select" mask="0x100000"/>
          <bitfield name="SERCOM3" caption="SERCOM3 Interrupt CPU Select" mask="0x400000"/>
          <bitfield name="SERCOM4" caption="SERCOM4 Interrupt CPU Select" mask="0x1000000"/>
          <bitfield name="SERCOM5" caption="SERCOM5 Interrupt CPU Select" mask="0x4000000"/>
          <bitfield name="TCC0" caption="TCC0 Interrupt CPU Select" mask="0x10000000"/>
          <bitfield name="TCC1" caption="TCC1 Interrupt CPU Select" mask="0x40000000"/>
        </register>
        <register name="INTCPUSEL1" offset="0x5C" rw="RW" size="4" initval="0x00000000" caption="Interrupts CPU Select 1">
          <bitfield name="TCC2" caption="TCC2 Interrupt CPU Select" mask="0x1"/>
          <bitfield name="TC0" caption="TC0 Interrupt CPU Select" mask="0x4"/>
          <bitfield name="TC1" caption="TC1 Interrupt CPU Select" mask="0x10"/>
          <bitfield name="TC2" caption="TC2 Interrupt CPU Select" mask="0x40"/>
          <bitfield name="TC3" caption="TC3 Interrupt CPU Select" mask="0x100"/>
          <bitfield name="TC4" caption="TC4 Interrupt CPU Select" mask="0x400"/>
          <bitfield name="ADC" caption="ADC Interrupt CPU Select" mask="0x1000"/>
          <bitfield name="AC" caption="AC Interrupt CPU Select" mask="0x4000"/>
          <bitfield name="DAC" caption="DAC Interrupt CPU Select" mask="0x10000"/>
          <bitfield name="PTC" caption="PTC Interrupt CPU Select" mask="0x40000"/>
          <bitfield name="AES" caption="AES Interrupt CPU Select" mask="0x100000"/>
          <bitfield name="TRNG" caption="TRNG Interrupt CPU Select" mask="0x400000"/>
          <bitfield name="PICOP" caption="PICOP Interrupt CPU Select" mask="0x1000000"/>
        </register>
        <register name="IRQTRIG" offset="0x60" rw="RW" size="2" initval="0x0000" caption="Interrupt Trigger">
          <bitfield name="ENABLE" caption="Trigger Enable" mask="0x1"/>
          <bitfield name="IRQNUM" caption="Interrupt Request Number" mask="0x3E"/>
          <bitfield name="OVERRIDE" caption="Interrupt Request Override Value" mask="0xFF00"/>
        </register>
      </register-group>
      <value-group name="TAL_CTICTRLA__ACTION">
        <value name="BREAK" caption="Break when requested" value="0"/>
        <value name="INTERRUPT" caption="Trigger DBG interrupt instead of break" value="1"/>
        <value name="IGNORE" caption="Ignore break request" value="2"/>
      </value-group>
    </module>
    <module name="TC" id="U2249" version="2.0.0" caption="Basic Timer Counter">
      <register-group class="union" union-tag="TC.CTRLA.MODE" name="TC" caption="Basic Timer Counter">
        <register-group name="COUNT8" name-in-module="TC_COUNT8" union-tag-value="1" offset="0"/>
